package main

import (
	"fmt"

	"github.com/pupuk/addr"
)

func main() {
	//"：", ":", "；", ";", "，", ",", "。", "."
	/*
		strArr := []string{"张三 13800138000 龙华区龙华街道1980科技文化产业园3栋308 身份证120113196808214821",
			"张三13800138000龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三,13800138000,龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三.13800138000.龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三;13800138000;龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三:13800138000:龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三：13800138000：龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三， 13800138000,，龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三；13800138000；龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",
			"张三。13800138000。龙华区龙华街道1980科技文化产业园3栋308身份证120113196808214821",

			"绵绵，13838633530，河南省周口市扶沟县崔桥镇大刘村",
			"13838633530，绵绵，河南省周口市扶沟县崔桥镇大刘村",
			"绵绵，河南省周口市扶沟县崔桥镇大刘村，13838633530",
			"绵绵，1383863353，河南省周口市扶沟县崔桥镇大刘村111",
			"绵绵，138386335311111，河南省周口市扶沟县崔桥镇大刘村111",
			"13838633530，河南省周口市扶沟县崔桥镇大刘村",
			"绵绵，13838633530",
			"绵绵，13838633530，河南省大刘村",
			"绵绵，13838633530",
			"绵绵，13838633530，河南省",
			"河南省周口市扶沟县崔桥镇大刘村",
		}
		for i := 0; i < len(strArr); i++ {
			parse := addr.Smart(strArr[i])

			// 输出解析结果
			fmt.Println(parse)
		}
	*/
	// parse := addr.Smart("北京市丰台区大瓦窑村")

	// // 输出解析结果
	// fmt.Println(parse.Name)     // 张三
	// fmt.Println(parse.IdNumber) // 120113196808214821
	// fmt.Println(parse.Mobile)   // 13800138000
	// fmt.Println(parse.PostCode) // 570100
	// fmt.Println(parse.Province) // 广东省
	// fmt.Println(parse.City)     // 深圳市
	// fmt.Println(parse.Region)   // 龙华区
	// fmt.Println(parse.Street)   // 龙华街道1980科技文化产业园3栋317
	// fmt.Println(parse.Address)  // 深圳市龙华区龙华街道1980科技文化产业园3栋317

	// parse = addr.Smart("艾洋洋 15623544635 广东省深圳市南山区1栋1")
	// fmt.Println(parse)

	parse := addr.Smart("广东省中山市东区xxxx街道")
	// 解析错误原因，应补充中山市三级行政区分类，广东省中山市中山市东区xxxx街道

	// 输出解析结果
	fmt.Println(parse.Name)     // 张三
	fmt.Println(parse.Mobile)   // 13800138000
	fmt.Println(parse.Province) // 广东省
	fmt.Println(parse.City)     // 深圳市
	fmt.Println(parse.Region)   // 龙华区
	fmt.Println(parse.Street)   // 龙华街道1980科技文化产业园3栋317

	parse = addr.Smart("广西壮族自治区 梧州市 长洲区 城区城区竹湾路南粤家居建材中心A11铺")
	// 解析错误原因，应合并地址信息，广西壮族自治区梧州市长洲区城区城区竹湾路南粤家居建材中心A11铺

	// 输出解析结果
	fmt.Println(parse.Name)     // 张三
	fmt.Println(parse.Mobile)   // 13800138000
	fmt.Println(parse.Province) // 广东省
	fmt.Println(parse.City)     // 深圳市
	fmt.Println(parse.Region)   // 龙华区
	fmt.Println(parse.Street)   // 龙华街道1980科技文化产业园3栋317
}
